# Data Analysis Lib

In [9]:
import numpy as np
import pandas as pd

In [27]:
data = {
    "name": ["zhangshan", "lisi", "wangwu"],
    "age": [18, 24, 20],
    "gender": ["male", "famale", "male"],
    "addr": ["chongqing", "chengdu", "shanghai"]
}
df = pd.DataFrame(data)
df

        name  age  gender       addr
0  zhangshan   18    male  chongqing
1       lisi   24  famale    chengdu
2     wangwu   20    male   shanghai

In [28]:
df.shape

(3, 4)

In [29]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [30]:
df.columns

Index(['name', 'age', 'gender', 'addr'], dtype='object')

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gender  3 non-null      object
 3   addr    3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [33]:
df.count()

name      3
age       3
gender    3
addr      3
dtype: int64

In [34]:
df.sum()

name           zhangshanlisiwangwu
age                             62
gender              malefamalemale
addr      chongqingchengdushanghai
dtype: object

In [36]:
df.cumsum()

                  name  age          gender                      addr
0            zhangshan   18            male                 chongqing
1        zhangshanlisi   42      malefamale          chongqingchengdu
2  zhangshanlisiwangwu   62  malefamalemale  chongqingchengdushanghai

In [38]:
df.min()

name         lisi
age            18
gender     famale
addr      chengdu
dtype: object

In [39]:
df.max()

name      zhangshan
age              24
gender         male
addr       shanghai
dtype: object

In [48]:
df.describe()

             age
count   3.000000
mean   20.666667
std     3.055050
min    18.000000
25%    19.000000
50%    20.000000
75%    22.000000
max    24.000000

In [49]:
df.mean(numeric_only=True)

/var/folders/kr/6s1y_bpd689_r394k_jtggxc0000gn/T/ipykernel_67087/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

age    20.666667
dtype: float64

In [ ]:
df.median(numeric_only=True)

In [12]:
df["name"]

0    zhangshan
1         lisi
2       wangwu
Name: name, dtype: object

In [13]:
df[1:]

     name  age  gender      addr
1    lisi   24  famale   chengdu
2  wangwu   20    male  shanghai

In [17]:
# 行列取值
df.iloc[[0], [0]]

        name
0  zhangshan

In [20]:
df.drop("name", axis=1)

   age  gender       addr
0   18    male  chongqing
1   24  famale    chengdu
2   20    male   shanghai

In [22]:
df.sort_index()

        name  age  gender       addr
0  zhangshan   18    male  chongqing
1       lisi   24  famale    chengdu
2     wangwu   20    male   shanghai

In [23]:
df.sort_values(by="age")

        name  age  gender       addr
0  zhangshan   18    male  chongqing
2     wangwu   20    male   shanghai
1       lisi   24  famale    chengdu

In [26]:
df.rank()

   name  age  gender  addr
0   3.0  1.0     2.5   2.0
1   1.0  3.0     1.0   1.0
2   2.0  2.0     2.5   3.0